backend/src/main/resources/templates/AuszahlungSapService/SST_077_BusinessPartnerChange.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:be.ch:KTBE_MDG:BUSINESS_PARTNER">
  <soapenv:Header/>
  <soapenv:Body>
    <urn:BusinessPartnerChange_Request>
      <SENDER>
        <SYSID>{data.sysId}</SYSID>
        <!--Optional:-->
        <BETRIEB/>
        <DELIVERY_ID>{data.deliveryId}</DELIVERY_ID>
        <!--Optional:-->
        <VERSION>1.0</VERSION>
      </SENDER>
      <BUSINESS_PARTNER>
        <HEADER>
          <BPARTNER>{data.businessPartnerId}</BPARTNER>
        </HEADER>
        <ID_KEYS>
          <!--Optional:-->
          <EXT_ID>{data.extId}</EXT_ID>
          <!--Optional:-->
          <AHV_NR/>
          <!--Optional:-->
          <UID_NR/>
          <!--Optional:-->
          <ZPV_NR/>
        </ID_KEYS>
        <!--Optional:-->
        <PERS_DATA>
          <!--Optional:-->
          <FIRSTNAME/>
          <!--Optional:-->
          <LASTNAME/>
          <!--Optional:-->
          <CORRESPONDLANGUAGEISO/>
          <!--Optional:-->
          <BIRTHNAME/>
          <!--Optional:-->
          <MIDDLENAME/>
          <!--Optional:-->
          <SECONDNAME/>
          <!--Optional:-->
          <TITLE_ACA2/>
          <!--Optional:-->
          <TITLE_SPPL/>
          <!--Optional:-->
          <PREFIX1/>
          <!--Optional:-->
          <PREFIX2/>
          <!--Optional:-->
          <NICKNAME/>
          <!--Optional:-->
          <INITIALS/>
          <!--Optional:-->
          <NAMEFORMAT/>
          <!--Optional:-->
          <NAMCOUNTRY/>
          <!--Optional:-->
          <NAMCOUNTRYISO/>
          <!--Optional:-->
          <BIRTHPLACE/>
          <!--Optional:-->
          <MARITALSTATUS/>
          <!--Optional:-->
          <CORRESPONDLANGUAGE/>
          <!--Optional:-->
          <FULLNAME/>
          <!--Optional:-->
          <EMPLOYER/>
          <!--Optional:-->
          <OCCUPATION/>
          <!--Optional:-->
          <NATIONALITY/>
          <!--Optional:-->
          <NATIONALITYISO/>
          <!--Optional:-->
          <COUNTRYORIGIN/>
          <!--Optional:-->
          <BIRTHDT_STATUS/>
        </PERS_DATA>
        <!--Optional:-->
        <ORG_DATA>
          <!--Optional:-->
          <NAME1/>
          <!--Optional:-->
          <NAME2></NAME2>
          <!--Optional:-->
          <NAME3/>
          <!--Optional:-->
          <NAME4/>
          <!--Optional:-->
          <LANGU_ISO/>
          <!--Optional:-->
          <LEGALFORM/>
          <!--Optional:-->
          <INDUSTRYSECTOR/>
          <!--Optional:-->
          <LOC_NO_1/>
          <!--Optional:-->
          <LOC_NO_2/>
          <!--Optional:-->
          <CHK_DIGIT/>
          <!--Optional:-->
          <LEGALORG/>
        </ORG_DATA>
        <!--Zero or more repetitions:-->
        <ADDRESS>
          <ADR_KIND>XXDEFAULT</ADR_KIND>
          <!--Optional:-->
          <C_O_NAME>{coAdresse ?: ''}</C_O_NAME>
          <!--Optional:-->
          <CITY>{data.auszahlung.adresse.ort}</CITY>
          <!--Optional:-->
          <DISTRICT/>
          <!--Optional:-->
          <POSTL_COD1>{data.auszahlung.adresse.plz}</POSTL_COD1>
          <!--Optional:-->
          <PO_BOX>.</PO_BOX>
          <!--Optional:-->
          <STREET>{data.auszahlung.adresse.strasse}</STREET>
          <!--Optional:-->
          <HOUSE_NO>{data.auszahlung.adresse.hausnummer}</HOUSE_NO>
          <!--Optional:-->
          <COUNTRY>{data.auszahlung.adresse.land}</COUNTRY>
          <!--Optional:-->
          <POSTL_COD2/>
        </ADDRESS>
        <!--Zero or more repetitions:-->
        <COMMUNICATION>
          <!--Optional:-->
          <EMAIL/>
          <!--Optional:-->
          <TELEPHONE/>
          <!--Optional:-->
          <MOBILE/>
          <!--Optional:-->
          <FAX/>
        </COMMUNICATION>
        <!--Zero or more repetitions:-->
        <PAYMENT_DETAIL>
          <BANK_ID/>
          <!--Optional:-->
          <IBAN>{data.auszahlung.iban}</IBAN>
          <!--Optional:-->
          <ACCOUNTHOLDER/>
        </PAYMENT_DETAIL>
        <!--Zero or more repetitions:-->
      </BUSINESS_PARTNER>
    </urn:BusinessPartnerChange_Request>
  </soapenv:Body>
</soapenv:Envelope>
